      	.data
calculator:
	.ascii "\nзддддддддддддддддддддддддддддддддддддддддддддддддд©"
	.ascii "\nЁ здддддддддддддддд©       зддддддддддддддддд©    Ё"
	.ascii "\nЁ ЁЫDec o Hex o BinЁ       Ё                 Ё    Ё"
	.ascii "\nЁ юдддддддддддддддды       юддддддддддддддддды    Ё"
	.ascii "\nЁ зддддддддддддддддддддддд©зд©зд©зд©здд©зддд©здд© Ё"
	.ascii "\nЁ ЁЫDeg o Radians o Grads ЁЁDЁЁEЁЁFЁЁM+ЁЁ M-ЁЁЁ Ё"
	.ascii "\nЁ юдддддддддддддддддддддддыюдыюдыюдыюддыюдддыюдды Ё"
	.ascii "\nЁ зддд©зддд©зддд©зддд©зддд©зд©зд©зд©здд©зддд©здд© Ё"
	.ascii "\nЁ Ё   ЁЁInvЁЁln ЁЁ(  ЁЁ ) ЁЁAЁЁBЁЁCЁЁЯ ЁЁ Ш ЁЁMSЁ Ё"
	.ascii "\nЁ юдддыюдддыюдддыюдддыюдддыюдыюдыюдыюддыюдддыюдды Ё" 
	.ascii "\nЁ зддд©здддд©зддд©здд©зддд©зд©зд©зд©здд©зддд©здд© Ё"
	.ascii "\nЁ ЁintЁЁsinhЁЁsinЁЁxЩЁЁ n!ЁЁ7ЁЁ8ЁЁ9ЁЁ/ ЁЁ % ЁЁMRЁ Ё"
	.ascii "\nЁ юдддыюддддыюдддыюддыюдддыюдыюдыюдыюддыюдддыюдды Ё"  
	.ascii "\nЁ зддд©здддд©зддд©здд©зддд©зд©зд©зд©здд©зддд©здд© Ё"
	.ascii "\nЁ ЁdmsЁЁcoshЁЁcosЁЁxЭЁЁnШxЁЁ4ЁЁ5ЁЁ6ЁЁ* ЁЁ1/xЁЁMCЁ Ё"
	.ascii "\nЁ юдддыюддддыюдддыюддыюдддыюдыюдыюдыюддыюдддыюдды Ё" 
	.ascii "\nЁ здд©здддд©зддд©зддд©зддд©зд©зд©зд©здд©зддд©здд© Ё"
	.ascii "\nЁ ЁЦ ЁЁtanhЁЁtanЁЁx^3ЁЁ3ШxЁЁ1ЁЁ2ЁЁ3ЁЁ- ЁЁ   ЁЁCEЁ Ё"
	.ascii "\nЁ юддыюддддыюдддыюдддыюдддыюдыюдыюдыюддыЁ = Ёюдды Ё" 
	.ascii "\nЁ зддд©зддд©зддд©зддд©зддд©здддд©зд©здд©Ё   Ёздд© Ё"
	.ascii "\nЁ ЁF-EЁЁExpЁЁmodЁЁlogЁЁ10ЭЁЁ  0 ЁЁ.ЁЁ+ ЁЁ   ЁЁ CЁ Ё"
	.ascii "\nЁ юдддыюдддыюдддыюдддыюдддыюддддыюдыюддыюдддыюдды Ё"
	.ascii "\nюддддддддддддддддддддддддддддддддддддддддддддддддды"
	.code

main:
	la $a0,calculator
	syscall $print_string
	syscall $exit 